OdTrVisRawTexture.data
\details
Returns raw texture data.
/returns raw texture data.
\details
Returns raw texture data.
/returns raw texture data.

OdTrVisRawTexture.format
\details
Returns the texture format.
/returns the texture format.

OdTrVisRawTexture.height
\details
Returns the height of the texture in pixels.
/returns the height of the texture in pixels.

OdTrVisRawTexture.width
\details
Returns the width of the texture in pixels.
/returns the width of the texture in pixels.

OdTrVisRawTexture.size
\details
Returns the total size of the texture in bytes.
/returns the total size of the texture in bytes.

OdTrVisRawTexture.pixelSize(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Returns the pixel size in the texture.
\param format [in] Texture format. See OdTrVisTexture::Format
\returns the pixel size in the texture if the format is correct or 1 otherwise.

OdTrVisRawTexture.resize(System.UInt32!System.Runtime.CompilerServices.IsLong,System.UInt32!System.Runtime.CompilerServices.IsLong,System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
This function resizes texture.
\param width [in] new texture width
\param height [in] new texture height
\param format [in] new texture format

OdTrVisRawTexture.Dispose
\details
Destroys the object.

OdTrVisRawTexture.#ctor
\details
Creates a new instance of an object with default parameters.

OdTrVisRawTexture
\details
This class is a raw texture data. It's a lighter version of OdTrVisTexture. Not requires TR_BASE_LIB. Can be simply converted to OdTrVisTexture.